label three:            
            c "{cps=10}แล้วคนร้ายมีจุดประสงค์อะไรที่ต้องทำร้ายผู้เสียหาย แล้วก็ดอกไม้สีขาวกับดาบ มันเกี่ยวข้องอะไรกับผู้เสียหายกัน{/cps}"
            show chr_a2
            b "{cps=10}อืม พวกเราต้องการข้อมูลเพิ่ม ข้อมูลตอนนี้ไม่เพียงพอต่อการสรุป ต้องไปสอบถามผู้เสียหายที่มีส่วนเกี่ยวข้องด้วย{/cps}"
            hide chr_a2
            show chr_a3
            c "{cps=10}งั้นก็เป็น เจ้าของร้านอาหารฝรั่งเศส ชื่อ อิจิ โซมะ  ,จูโซ ยามะ และ จูยามุ นิโนะ ที่เป็นผู้เสียหายสินะ{/cps}"
            hide chr_a3
            show chr_a2
            b "{cps=10}ผมได้สอบถามข้อมูลเกี่ยวกับ จูโซ ยามะ และ จูยามุ นิโนะ ที่ทางตำรวจให้ข้อมูลมา เป็นผู้ช่วยของเจ้าของร้านอาหารในอควาเรียม
                ชื่อคิวจู โดมะ ที่เป็นเพื่อนกับอิจิ โซมะ ในฐานะเพื่อนสนิท{/cps}"
            hide chr_a2
            show chr_a3
            c "{cps=10}แสดงว่า คนร้ายคิดจะทำร้ายคนรอบตัวของอิจิ โซมะ กับคิวจู โดมะสินะ แล้วมีใครที่เกี่ยวข้องกับเขาบ้างไหม{/cps}"
            hide chr_a3
            show chr_a2
            b "{cps=10}ก็มีหัวหน้าเชฟ และผู้ช่วยของเขา ที่ชื่อจูโยว อิจิโตะและ นิชิตะ คุกะ{/cps}"
            hide chr_a2
            show chr_a3
            c "{cps=10}งั้นพรุ่งนี้ไปหา จูโยว อิจิโตะ ที่เป็นหัวหน้าเชฟในบ้านพักของเขา เพื่อถามถึงความเชื่อมโยงที่เกี่ยวข้องกับคนร้ายและปกป้องเขาไปด้วย{/cps}"
            hide chr_a3
            show chr_a2
            b "{cps=10}ก็ดีนะครับ งั้นวันนี้พวกเราผักผ่อนแล้วพรุ่งนี้ไปบ้านเขากันครับ{/cps}"
            hide chr_a2
            show chr_a3
            c "{cps=10}งั้นผมจะไปนอนก่อน{/cps}"
            hide chr_a3
            show chr_a2
            b "{cps=10}ผมก็จะนอนเหมือนกันครับ{/cps}"
            hide chr_a2
            show chr_a3
            c "{cps=10}ราตรีสวัสดิ์คู่หู{/cps}"
            hide chr_a3
            show chr_a2
            b "{cps=10}ราตรีสวัสดิ์เช่นกันครับ{/cps}"
            hide chr_a2
            
            scene room
            "{cps=10}วันต่อมา นักสืบกับผู้ช่วยนักสืบ ได้มาที่หน้าบ้านพักของหัวหน้าเชฟ 
            เพื่อถามถึงความเชื่อมโยงที่เกี่ยวข้องกับคนร้ายและปกป้องเขาไปด้วย{/cps}"
            show chr_a2
            b "{cps=10}สวัสดีครับ วันนี้ขอถามเรื่องเกี่ยวกับการทำงานในอาชีพเชฟ 
            และผู้คนที่อยู่รอบตัวของคุณได้ไหมครับ{/cps}"
            hide chr_a2
            show chr_a3
            show chr_k2 at right
            e "{cps=10}ทำไมต้องถามเรื่องนี้ด้วยมันเกี่ยวกับเหตุการณ์เมื่อวานเหรอไง ผมจะไม่ให้ความร่วมมืออะไรทั้งนั้น{/cps}"
            hide chr_k2 at right
            show chr_k3 at right
            c "{cps=10}คุณต้องฟังที่เราพูดน่ะครับ ไม่งั้นคุณจะตกอยู่ในอันตราย เรื่องราวเป็นมาอย่างนี้ครับ{/cps}"
            
            scene e
            "{cps=10}นักสืบกับผู้ช่วยนักสืบได้อธิบายเหตุการณ์และการคาดเดาเกี่ยวกับคนร้ายให้ จูโยว อิจิโตะฟัง{/cps}"
            hide chr_k3 at right
            show chr_k1 at right
            e "{cps=10}โอเคผมเข้าใจเรื่องราวแล้ว แต่ว่าที่พวกคุณอยากถามมันไม่มีอะไรที่เกี่ยวข้องกับผมเลย 
                แล้วทำไมต้องมาจ้องเล่นงานผมด้วยเล่า{/cps}"
            hide chr_k1 at right
            show chr_k3 at right
            hide chr_a3
            show chr_a2
            b "{cps=10}ทางพวกเราไม่ทราบเจตนาของคนร้าย แต่ว่าคนร้ายจ้องเล่นงานคุณจริงๆนะครับ{/cps}"
            hide chr_k3 at right
            show chr_k1 at right
            hide chr_a2
            show chr_a3
            e "{cps=10}มันไม่เกี่ยวกับผมสักนิด เชิญพวกคุณออกไปด้วย{/cps}"
            hide chr_k1 at right
            show chr_k3 at right
            hide chr_a3
            show chr_a2
            b "{cps=10}เดี๋ยวก่อนสิครับ{/cps}"
            hide chr_k3 at right
            hide chr_a2
            z "{cps=10}เพล้ง ง ง{/cps}"
            show chr_k1 at right
            e "{cps=10}เสียงอะไรกัน วันนี้พวกคุณเชิญออกไปด้วยตอนนี้ผมยุ่งมากแล้ว{/cps}"
            hide chr_k1 at right
            show chr_k4 at right
            e "{cps=10}ใครปาก้อนหินมาที่กระจกประตูบ้านผม{/cps}"
            hide chr_k4 at right
            show chr_k3 at right
            show chr_a2
            b "{cps=10}อย่าเปิดประตูครับ รีบปิด (เมื่อผู้ช่วยเห็นมีคนอยู่ด้านนอก คนร้ายอยู่นอกบ้าน){/cps}"
            hide chr_k3 at right
            show chr_k2 at right
            hide chr_a2
            
            
            scene d
            show chr_k2
            e "{cps=10}ห่ะ !!{/cps}!"
            hide chr_k2 at right
            hide chr_a3
            "{cps=10}จูโยว อิจิโตะ ที่หันมาตะโกนใส่พวกนักสืบก็ได้โดนลูกธนูยิงลอดช่องกระจกที่แตกใส่ก้นของจูโยว อิจิโตะ 
            พร้อมหนีไปด้วยรถมอเตอร์ไซต์{/cps}"
            show chr_k2 at right
            e "{cps=10}อ๊ากกกก ก้นฉัน พวกนายยังยืนเฉยอีกช่วยผมทีสิว่ะ{/cps}"
            hide chr_k2 at right
            c "{cps=10}ยาสุโอะช่วยปฐมพยาบาลฐานให้เขาหน่อย เดี๋ยวฉันตามไปจับคนร้ายก่อน{/cps}"
            show chr_k2
            b "{cps=10}ได้ครับ อยู่นิ่งนะครับ จูโยว{/cps}"
            hide chr_a2
            scene rooom1
            "{cps=10}หลังจากที่นักสืบ วิ่งไล่ตามจับคนร้าย ที่ขับรถฝ่าไฟแดง ก็คลาดเคลื่อนกับคนร้าย 
            จนตามหาตัวไม่เจออีก{/cps}"
            "{cps=10}ก็ได้กลับมาถึงบ้านพักของจูโยว นักสืบก็สังเกตุเห็นอะไรบ้างอย่าง {/cps}"
            label rooom:
                    call screen House1
            label rooom1:
                            scene rooom1
                            $  tool_y +=1
                            label rom:
                                scene rooom
                                show sword
                                c "{cps=10}นี้มัน สัญลักษณ์อินฟินิตี้ !!! ที่ไม่มีจุดสิ้นสุด{/cps}"
                                hide sword
                                $ f7 = True
                                c "{cps=10}อย่างงี้นี้เอง เข้าใจเหตุการณ์เกือบทั้งหมดแล้ว 
                                คนร้ายเลือกลงมือกับคนที่มีรายชื่อตรงกับหมายเลขบนไพ่สิน่ะ{/cps}"
                                c "{cps=10}ดอกไม้สีขาวซึ่งเป็นสัญลักษณ์ไพ่ของ ควีน ต่อมาดาบซึ่งเป็นสัญลักษณ์ไพ่ คิง{/cps}"
                                c "{cps=10} ส่วนตอนนี้ที่คนร้ายได้ทิ้งไว้หน้าบ้านเหยื่อคือปอกดาบซึ่งเป็นสัญลักษณ์ไพ่ แจ็ค 
                                ซึ่งคนร้ายใช้ลำดับเลขบนไผ่ในการกำหนดเป้าหมาย{/cps}"
                                "หลังจากเหตุการณ์สงบลงแล้ว นักสืบก็อธิบาย ข้อมูลที่พอเจอให้ผู้ช่วยนักสืบกับตำรวจฟัง"
                                c "{cps=10}เรื่องที่รู้ก็เป็นอย่างที่บอกไปนี้ล่ะ{/cps}"
                                show chr_a2
                                b "{cps=10}อย่างนี้นี่เอง พอมาคิดตามที่นักสืบบอก ผมเข้าใจเรื่องราวแล้วล่ะ{/cps}"
                                hide chr_a2
                                show chr_f2
                                j "{cps=10}เข้าใจล่ะ ผมจะเตรียมตัวกลับสถานีตำรวจหลังจากที่ตรวจสอบพื้นที่เสร็จก่อน{/cps}"
                                hide chr_f2
                                jump three1
            label rooom2:
                                scene rooom1
                                c "{cps=10}พุ่มไม้{/cps}"
                                if click_count < max_clicks:
                                    $ click_count += 1
                                    jump rooom
                                else:
                                    $ click_count = 0
                                    jump rooom4
            label rooom3:
                                scene rooom1
                                c "{cps=10}หินธรรมดา{/cps}"
                                if click_count < max_clicks:
                                    $ click_count += 1
                                    jump rooom
                                else:
                                    $ click_count = 0
                                    jump rooom4
            label rooom4:
                show chr_a2
                b "{cps=10}นักสืบ ผมโทรเรียกรถพยาบาล กับ ตำรวจมาแล้ว{/cps}"
                hide chr_a2
                show chr_f13 at left
                j "{cps=10}นายมาแล้วเหรอจับตัวคนร้ายได้ไหม{/cps}"
                hide chr_f13at left
                show chr_f12 at left
                c "{cps=10}ไม่ได้เพราะคนร้ายไปทางที่แคบและอาศัยช่วงผู้คนแตกตื่น 
                ขับรถหนีไปได้ แล้วคุณจูโยว อิจิโตะล่ะ เป็นยังไงบ้าง{/cps}"
                show chr_a2
                b "{cps=10}อ่อ ผมให้เขาส่งโรงพยาบาลแล้วนะครับ 
                แล้วพวกเราพบวัตถุหลักฐานที่คนร้ายจงใจทึ้งไว้ที่หน้าประตูด้วย{/cps}"
                hide chr_a2
                show chr_a3
                hide chr_f12 at left
                show chr_f13 at left
                j "{cps=10}พวกนายคิดว่าคนร้ายจะเป็นคนผีพนันรึเปล่า{/cps}"
                hide chr_f13 at left
                $  yes_y = False
                $  no_y = False
                                
                label yesno:
                        menu : 
                                c"   "
                                "ไม่แน่ใจ ยังขาดข้อมูลที่น่าเชื่อถือ ข้อมูลไม่ประติดประต่อกัน บางส่วนก็แปลกๆ"if yes_y == False:
                                        $ yes_y = True
                                        jump yes
                                "ไม่ใช่ ไม่ใช่แน่ๆ ข้อมูลไม่ได้เชื่อมโยงกันเลย"if no_y ==False:
                                        $ no_y = True
                                        jump no
                                "มีส่วนเกี่ยวข้องกัน ต้องเป็นผีพนัน หรือ สิ่งที่ใกล้เคียงกัน"if  tool_y > 5:
                                        jump gotool
                label no:
                    c "{cps=10}ไม่น่าใช่นะครับ เพราะคนร้ายไม่เกี่ยวข้องกับคาสิโนสักอย่างเลย{/cps}"
                    show chr_f13 at left
                    j   "{cps=10}ถ้านักสืบสรุปมาอย่างงั้น ผมจะเชื่อในตัวนักสืบ{/cps}"
                    hide chr_f13 at left
                    show chr_f12 at left
                    "สารวัตรทาเครุ ยื่นบางอย่างให้คุณนักสืบดู"
                    c  "{cps=10}อะไรครับแค่ปลอกดาบเอง{/cps}"
                    hide chr_f12 at left
                    show chr_f13 at left
                    j "{cps=10}  นี่เป็นนักสืบแน่ใช่มั้ยเนี่ย ผมขอถอนคำพูดที่ว่าคุณเก่งแล้วกัน{/cps}"
                    hide chr_f13 at left
                    c "{cps=10}แล้วมันเกี่ยวข้องอะไรกับสิ่งนี้{/cps}"
                    show chr_f13 at left
                    j "{cps=10}ก็มันเป็นสิ่งที่คนร้ายทิ้งไว้ในที่เกิดเหตุ คุณนักสืบก็ไปไตร่ตรองดูแล้วกัน 
                    ว่ามันเกี่ยวข้องกันอย่างไร{/cps}"
                    hide chr_f13 at left
                    c "{cps=10}นั้นคือสิ่งที่ฉันจะทำอยู่แล้ว จะตามสืบข้อมูลเพิ่มอีก ต้องรู้ให้ได้ว่ามันเกี่ยวข้องกันอย่างไร{/cps}"
                    show chr_f13 at left
                    j "{cps=10}คุณนักสืบ...{/cps}"
                    hide chr_f13 at left
                    "นักสืบแหงนหน้ามองท้องฟ้า ยามอาทิตย์ตกดิน ท่ามกลางความคิดที่วุ่นวาย กับ ผู้ช่วนนักสืบที่มองด้วยความเป็นห่วง"
                    jump gery
                    
                label yes:
                    c "{cps=10}ต้องการข้อมูลมากกว่านี้ เพื่อมาสรุป{/cps}"
                    show chr_f13 at left
                    j "{cps=10} คุณเป็นสุดยอดนักสืบได้ไงเนื้ย ข้อมูลขนาดนี้ก็ยังไม่มั่นใจในความคิดของตัวเอง  
                    ฟังให้ดีล่ะคุณนักสืบ ผู้ร้ายมันมีส่วนเกี่ยวข้องกับเลขบนไพ่ก่อนหน้านั้น{/cps}" 
                    j "{cps=10}ดอกไม้สีขาวซึ่งเป็นสัญลักษณ์ไพ่ของ ควีน{/cps}"
                    j "{cps=10}ต่อมาดาบซึ่งเป็นสัญลักษณ์ไพ่ คิง ส่วนตอนนี้ที่ได้มาคือปลอกดาบซึ่งเป็นสัญลักษณ์ไพ่ 
                    แจ็ค ซึ่งคนร้ายใช้ลำดับเลขบนไผ่ในการกำหนดเป้าหมาย{/cps}"
                    hide chr_f13 at left
                    c "{cps=10}งั้นก็คนต่อไปมันเกี่ยวกับไพ่เลข10 ใช่ไหมแล้วหายังไง{/cps}"
                    jump three1
                
                label gotool:
                    show chr_f13 at left
                    j "{cps=10}คุณเริ่มจับจุดได้แล้วสิน่ะ{/cps}"
                    hide chr_f13 at left
                    c "{cps=10}ใช่ ค่อนข้างมั่นใจเลยล่ะ{/cps}"
                    c "{cps=10}ผู้ร้ายใช้วิธี การนับถอยหลังหมายเลขจากไพ่ จากเลขลำดับไพ่สูงสุด สู่ลำดับล่าง {/cps}"
                    c "{cps=10}ซึ่งเลขบนไพ่ก่อนหน้านั้นคือดอกไม้สีขาวซึ่งเป็นสัญลักษณ์ไพ่ ควีน   
                    ต่อมาดาบซึ่งเป็นสัญลักษณ์ไพ่ คิง ส่วนตอนนี้ที่ได้มาคือปลอกดาบซึ่งเป็นสัญลักษณ์ไพ่ แจ็ค{/cps}"
                    show chr_f13 at left
                    j "{cps=10} สรุปได้เฉียบขาดมาก สมกับเป็นสุดยอดนักสืบ{/cps}"
                    hide chr_f13 at left
                    jump three1
                    
                label three1:
                    show chr_a2
                    b "{cps=10}ผมว่าพวกเราต้องรีบหาคนที่มีชื่อที่สามารถผวนชื่อตัวเองที่ตรงกับการระบุหมายเลขตามลำดับไพ่ และคุ้มครอง{/cps}"
                    hide chr_a2
                    show chr_a3
                    c "{cps=10}ใช่ๆ ตานนั้นเลย{/cps}"
                    show chr_f13 at left
                    j "{cps=10}แล้วเลขเกี่ยวกับชื่ออย่างไร{/cps}"
                    hide chr_f13 at left
                    show chr_f12 at left
                    hide chr_a33
                    show chr_a2
                    b "{cps=10}ก็ชื่อคนแรกจูโซ ยามะ   จูยามุ นิโนะ และจูโยว อิจิโตะ ที่คำประกอบในชื่อแต่ละคนคือ จูโซ จูนิโนะ และจูอิจิ
                        ซึ่งที่เป็น13 12 11เป็นเลขของ คิง ควีน และแจ็ค ไงล่ะ{/cps}"
                    hide chr_f12 at left
                    show chr_f13 at left
                    hide chr_a2
                    show chr_a3
                    j   "{cps=10}แบบนั้นจริงทางเราต้องรีบหาคนชื่อที่เกี่ยวข้องกับเลข10 ของคนที่รู้จักของอิจิ โซมะ เร็วๆแล้วเสียแล้ว{/cps}"
                    hide chr_f13 at left
                    show chr_f12 at left
                    c  "{cps=10}ถ้างั้นพวกเราขอกลับสำนักงานของพวกเราก่อนเพื่อตามหาคนที่มีชื่อใกล้เคียงกันด้วย{/cps}"
                    hide chr_f12 at left
                    show chr_f13  at left
                    j   "{cps=10}ถ้างั้นก็รีบกลับไปค้นหาคนเลย ส่วนตรงนี้พวกเราจัดการเองให้เสร็จ 
                    แล้วจะตามหาคนใกล้เคียงกับไพ่เลขอื่นที่เป็นคนใกล้ชิดรอบตัวของอิจิ โซมะ{/cps}"
                    hide chr_f13 at left
                    show chr_f12 at left
                    hide chr_a3
                    show chr_a2
                    b  "{cps=10}โอเค งั้นพวกเรากลับที่สำนักงานเลยนะครับ{/cps}"
                    hide chr_f12 at left
                    show chr_f13 at left
                    hide chr_a2
                    show chr_a3
                    j   "{cps=10}ขอให้พวกนายหาคนร้ายเจอเร็วๆล่ะ{/cps}"
                    hide chr_f13  at left
                    hide chr_a3
                    "ระหว่างที่กำลังกลับสำนักงาน นักสืบ ก็ได้คิดถึงเหตูการณ์ที่ผ่านมา"
                    c "{cps=10}(ทำไมถึงได้รู้สึกว่าคนร้ายจงใจทำ เหมือนตั้งใจจะปกปิดอะไรสักอย่าง){/cps}" 
                    c "{cps=10}(ถ้าเป็นจริงคนร้ายทำเพื่ออะไรกันแน่){/cps}" 
                    
                    jump gery
                
                label sec:
                    ""
                    scene background
                    ""
                    $ renpy.music.stop(channel="sound_effect")
                    scene work
                    "ตอน การฆ่าต่อเนื่อง"
                    $ renpy.music.queue("audio/chr2.mp3", channel="sound_effect")
                    "วันต่อมา"
                    "{cps=10}ณ ตอนเช้าที่อากาศแจ่มใสมีสองนักสืบที่กำลังสืบค้นข้อมูลบางอย่างที่เกี่ยวข้องกับคนร้าย{/cps} "
                    c  "{cps=10}ทางนั้นได้ขอมูลอะไรมาบ้าง ที่เกี่ยวข้องกับเป้าหมายของคนร้าย{/cps} "
                    show chr_a2
                    b "{cps=10}ทางนี้ไม่เจอข้อมูลอะไรเพิ่มเติมเลยครับ{/cps} "
                    hide chr_a2
                    show chr_a3
                    c "{cps=10}ใกล้ถึงเวลาที่นัดกับทางตำรวจไว้ยัง{/cps} " 
                    hide chr_a3
                    show chr_a2
                    b "{cps=10}ใกล้ถึงเวลาที่นัดไว้กับสำนักงานตำรวจไว้แล้ว{/cps} "
                    hide chr_a2
                    show chr_a3
                    c  "{cps=10}งั้นก็เก็บรวบรวมข้อมูลที่เราค้นเจอมาไปคุยกับสารวัตรทาเครุ{/cps} "
                    hide chr_a3
                    show chr_a2
                    b "{cps=10}โอเคครับ งั้นพวกเราก็รีบเดินทางไปสำนักงานตำรวจกันเถอะครับ{/cps} "
                    hide chr_a2
                    show chr_a3
                    c  "{cps=10}ได้เลย ไปรีบกันเถอะ{/cps} "
                    hide chr_a3
                    
                    scene free
                    "{cps=10}ในห้องทำงานสารวัตรทาเครุ ผู้ช่วย ยาสุโอะ กับ %(c)sกำลังประชุมหารือเรื่องที่เกี่ยวข้องกับคนร้ายและข็อมูลที่รวบรวมมาจนถึงปัจจุบัน{/cps} "
                    c "{cps=10}ผมคิดว่าเป็นคนนี้ครับ{/cps}"
                    show chr_f13 at left
                    j "{cps=10}อืม จูโคโร่ อาคายุย ที่เป็นคนแจกไพ่ในคาสิโนควาเรียมใต้ทะเลของคิวจู โดมะ และเธอก็ถนัดซ้ายด้วย{/cps} "
                    hide chr_f13 at left
                    show chr_f12 at left
                    show chr_a2
                    b "{cps=10}ใช่ครับและความน่าจะเป็นคนร้ายในคดีมีมากที่สุด {/cps} "
                    hide chr_a2
                    show chr_a3
                    c "{cps=10}แต่ว่าทำไมคนร้ายต้องเจาะจงคนที่มีชื่อผวนเป็นหมายเลขที่ตรงกับเลขบนไพ่ด้วย{/cps}"
                    c  "{cps=10}หรือคนร้ายจะมีความแค้นกับบ้างคนที่มีหมายเลขตรงกับไพ่ 
                            ซึ่งเลข10 คนปัจจุบันที่พวกเราสืบเจอ คือ คุณ จูโคโร่ อาคายุย{/cps} "
                    hide chr_a3
                    show chr_a2
                    b "{cps=10}นั้นสินะแต่ คุณ จูโคโร่ อาคายุย อยู่ที่ไหน พวกเราสืบหาไม่เจอตัวตนเลย{/cps} "
                    hide chr_a2
                    show chr_a3
                    hide chr_f12 at left
                    show chr_f13 at left
                    j  "{cps=10}ถึงจะไม่รู้ว่าเป็นเขาจริงๆหรือเปล่า แต่จากข้อมูลที่รวบรวมมา {/cps}"
                    j  "{cps=10}มีโอกาสที่จะเป็น คุณจูโคโร่ อาคายุย สูงมาก พวกเราต้องไปสืบสวนที่อควาเรียม ด้วย{/cps} "
                    hide chr_a3
                    show chr_a2
                    hide chr_f13 at left
                    show chr_f12 at left
                    b "{cps=10}ถ้างั้นพวกเราเข้าไปสอบถามข้อมูลของคุณจูโคโร่ อาคายุย ในอควาเรียม โดยตรงเลยดีกว่า จะได้รู้กันว่าเข้าข่ายคนร้ายจริงไหม{/cps} "
                    hide chr_a2
                    show chr_a3
                    c "{cps=10}แต่ระหว่างนั้นถ้าเจอคนที่ชื่อเกี่ยวข้องกับเลขไพ่ลำดับที่ 9 ถึง 1 เมื่อไร...{/cps} "
                    hide chr_f12 at left
                    label ft:
                            menu : 
                                c"   "
                                "อธิบายเกี่ยวกับคดีให้กับคนๆนั้นได้รับรู้ ":
                                    jump ft1
                                "คุ้มครองความปลอดภัยให้ และพยายามอย่าให้คนผู้นั้นแตกตื่น":
                                    jump ft1
                    label ft1:             
                            show chr_f13 at left
                            j "{cps=10}โอเค เข้าใจแล้ว ถ้างั้นเตรียมตัวไปเจอ คุณจูโคโร่ อาคายุย ที่อควาเรียม{/cps} "
                            hide chr_a3
                            show chr_a2
                            hide chr_f13 at left
                            show chr_f12 at left
                            b "{cps=10}โอเค เอาตามนี้เลย เพราะว่าเธอเป็นใกล้ตัวของคิวจู โดมะและ ความแค้นกับ อิจิโซมะด้วย{/cps} "
                            hide chr_a2
                            hide chr_f12 at left
                            
                            scene ocean
                            "{cps=10}สารวัตรทาเครุ ผู้ช่วย ยาสุโอะ กับ  %(c)s ได้เดินทางมาถึงที่หน้าทางเข้าอควาเรียมและกำลังเตรียมตัวที่จะเข้าไปในอควาเรียม{/cps} "
                            show chr_f13 at left
                            j "{cps=10}พวกเรามาถึงที่เรียบร้อยแล้ว คุณนักสืบกับผู้ช่วย{/cps} "
                            show chr_a2
                            hide chr_f13 at left
                            show chr_f12 at left
                            b "{cps=10}ที่นี่นะหรืออควาเรียม แค่ยังไม่ใช่อาคารหลักของอควาเรียม ก็อลังการแล้ว{/cps} "
                            hide chr_a2
                            scene car
                            show chr_a3
                            c "{cps=10}มีลานจอดรถที่กว้างมาก สมกับเป็นอควาเรียมที่พึ่งสร้างเสร็จได้ไม่นาน{/cps}"
                            hide chr_f12 at left
                            show chr_f13 at left
                            j "{cps=10}ก็ปกติกับงานเปิดตัวอควาเรียมในวันแรกด้วยสินะ{/cps} "
                            hide chr_f13 at left
                            "{cps=10}ในขณะที่กลุ่มตำรวจกับนักสืบกำลังอึ้งกับบริเวณหน้าทางเข้าอควาเรียมก็
                            ได้ยินเสียงรถยนต์ที่ดังกระหึ่มขับเข้ามาจอดหน้าทางเข้าอควาเรียม{/cps} "
                            show chr_f12 at left
                            show chr_1 at right
                            z "{cps=10}ขอโทษนะครับ ที่ผมเปิดประตูรถโดยไม่ดูคน ไม่เป็นอะไรใช่ไหม{/cps} "
                            hide chr_1 at right
                            show chr_e3 at right
                            hide chr_a3
                            show chr_a2
                            b  "{cps=10}ไม่เป็นอะไรครับ เดี๋ยวก่อนนะคุณคือ จิกิตะ ฮาจิโตะใช่ไหมที่เป็นผู้เชี่ยญชาญไวน์{/cps} "
                            scene ocean1
                            hide chr_a2
                            show chr_a3
                            hide chr_e1 at right
                            show chr_e3 at right
                            t "{cps=10}ใช่ครับ ผมชื่อจิกิตะ ฮาจิโตะเอง{/cps} "
                            hide chr_a3
                            show chr_a2
                            hide chr_e3 at right
                            show chr_e1 at right
                            b "{cps=10}แล้วมาทำอะไรที่นี่ครับ{/cps} "
                            hide chr_a2
                            show chr_a3
                            hide chr_e1 at right
                            show chr_e3 at right
                            t "{cps=10} อ่อ ผมได้รับบัตรเชิญจากเลขาของ คุณคิวจู โดมะ  ให้มาดูเรื่องไวน์และชมอควาเรียมของเขาครับ{/cps} "
                            hide chr_e3 at right
                            hide chr_f12 at left
                            show chr_f13 at left
                            j "{cps=10}งั้นก็ดีเลย ผมอยากบอกคุณเกี่ยวกับเหตุผลที่พวกผมมาที่นี่ด้วยนะครับ{/cps} "
                            hide chr_e1 at right
                            show chr_e3 at right
                            hide chr_f13 at left
                            show chr_f12 at left
                            t "{cps=10}เรื่องอะไรเหรอครับ{/cps} "
                            hide chr_e3 at right
                            show chr_e1 at right
                            hide chr_a3
                            show chr_a2
                            b "{cps=10}เดี๋ยวผมอธิบายให้กับคุณเอง{/cps} "
                            "{cps=10}ผู้ช่วยนักสืบได้อธิบายเกี่ยวกับคดีฆาตรกรรมต่อเนื่องในช่วงนี้ให้ จิกิตะ ฮาจิโตะได้รับรู้{/cps} "
                            hide chr_e1 at right
                            show chr_e3 at right
                            hide chr_a2
                            show chr_a3
                            t "{cps=10}อ่อ เรื่องราวเป็นอย่างงี้นี้เอง ที่ทำให้พวกคุณมาหา คุณจูโคโร่ อาคายุย
                            ที่เป็นผู้ต้องสงสัยว่าจะเป็นคนร้ายเหรอครับ{/cps} "
                            hide chr_e3 at right
                            show chr_e1 at right
                            c "{cps=10}ใช่ครับ เพราะว่าโอกาสสูงมากที่เธอจะเป็นคนร้ายในคดีนี้ครับ{/cps}"
                            hide chr_f12 at left
                            show chr_f13 at left
                            j "{cps=10}แต่ว่าพวกเราไม่สามารถที่จะเข้าไปในอคาเรียม เพื่อเข้าไปหา คุณจูโคโร่ อาคายุย ได้ครับ{/cps}"
                            hide chr_f13 at left
                            show chr_f12 at left
                            hide chr_a3
                            show chr_a2
                            b "{cps=10}ทีแรกคิดว่าจะขอเข้าพบในฐานะเจ้าหน้าที่ตำรวจเพื่อขอสืบค้นเกี่ยวกับคดีที่เกิดขึ้น แต่ตอนนี้มีคุณ จิกิตะ ฮาจิโตะ 
                            เลยคิดว่าขอเข้าพร้อมกับคุณในฐานะเพื่อนของคุณได้{/cps}"
                            hide chr_f12 at left
                            show chr_f13 at left
                            hide chr_a2
                            show chr_a3
                            j "{cps=10}ใช่ๆ เพื่อให้เข้าใกล้ตัว คุณจูโคโร่ อาคายุย ได้ง่ายขึ้นด้วย{/cps}"
                            hide chr_f13 at left
                            show chr_f12 at left
                            c "{cps=10}แล้วก็ตามหาคนที่มีชื่อผวนที่เกี่ยวกับเลขใกล้เคียงของไพ่ได้ด้วย อย่างเช่นคุณ จิกิตะ ที่มีชื่อเลข 8{/cps}"
                            hide chr_e1 at right
                            show chr_e3 at right
                            t "{cps=10}ถ้างั้นผมก็มีส่วนเกี่ยวข้องกับเรื่องนี้สินะครับ เพราะชื่อผมก็มีคำว่า ฮาจิ ที่เป็นเลข8 จริงครับ และ 
                                    คิวจู โดมะ ที่เจ้าของอควาเรียมก็มีชื่อเกี่ยวกับเลข9 ด้วย{/cps}"
                            hide chr_e3 at right
                            show chr_e1 at right
                            hide chr_a3
                            show chr_a2
                            b "{cps=10}ใช่ นั้นเป็นเหตุผล ที่ทำให้เราเดินทางมาที่นี้ด้วย{/cps}"
                            hide chr_e1 at right
                            show chr_e3 at right
                            hide chr_a2
                            show chr_a3
                            t  "{cps=10}เพื่อเป็นการแลกเปลี่ยนที่ผมพาพวกคุณเข้า อควาเรียม 
                            พวกคุณต้องปกป้องผม ไม่ให้คนร้ายมาลอบทำร้ายผมด้วย{/cps}"
                            hide chr_e3 at right
                            show chr_e1 at right
                            hide chr_f12 at left
                            show chr_f13 at left
                            j "{cps=10}เป็นข้อเสนอที่ดี พวกเราคิดที่จะทำอย่างนั้นกันอยู่แล้ว{/cps}"
                            hide chr_f13 at left
                            show chr_f12 at left
                            hide chr_a3
                            show chr_a2
                            b "{cps=10}ใช่ ตามนั้นเลย{/cps}"
                            hide chr_a2
                            show chr_a3
                            hide chr_e1 at right
                            show chr_e3 at right
                            t "{cps=10}งั้นก็แสดงว่าข้อตกลงบรรลุผลแล้วนะครับ{/cps}"
                            hide chr_e3 at right
                            show chr_e1 at right
                            hide chr_a3
                            show chr_a2
                            b "{cps=10}งั้นพวกเราไปที่นัดกับเพื่อนจิกิตะ ฮาจิโตะกัน{/cps}"
                            hide chr_e1 at right
                            hide chr_f12 at left
                            hide chr_a2
                            
                            scene c
                            "{cps=10}  พวกนักสืบกับตำรวจและจิกิตะ ฮาจิโตะ มาถึงที่นัดหมายทางบัตรเชิญ ที่หน้ากระเช้าลอยฟ้า{/cps}"
                            show chr_e3 at right
                            t "{cps=10}โอเค มาถึงที่หมายแล้ว{/cps}"
                            hide chr_e3 at right
                            show chr_e1 at right
                            show chr_a2
                            b "{cps=10}ที่นี่นะหรือสถานที่นัดหมาย  เป็นที่หน้ากระเช้าลอยฟ้าสินะ{/cps}"
                            hide chr_e1 at right
                            show chr_e3 at right
                            show chr_a3
                            hide chr_a2
                            t "{cps=10}ครับ น่าจะได้เวลาที่พวกคนที่ได้รับเชิญจะถึงแล้วครับ{/cps}"
                            hide chr_e3 at right
                            show chr_1 at right
                            z "{cps=10}ก็ใช่ไง แต่นายเป็นมาช้าสุดในบรรดาคนที่ได้รับเชิญเลย{/cps}"
                            hide chr_1 at right
                            show chr_e3 at right
                            t "{cps=10}ขอโทษทีนะ ที่มาถึงช้า พอดีมีธุระเล็กน้อยกับพวกเขา {/cps}"
                            hide chr_e3 at right
                            show chr_e1 at right
                            show chr_j11 at left
                            n "{cps=10}ใครกันนะ{/cps}"
                            hide chr_j11 at left
                            show chr_d14 at left
                            s "{cps=10}พวกคุณเองเหรอมาทำอะไรที่นี่ละครับ{/cps}"
                            hide chr_d14 at left
                            show chr_f13 at left
                            j "{cps=10}เดี๋ยวผมจะอธิบายสถานการณ์ให้ทุกคนที่นี่ได้ฟังเอง{/cps}"
                            "{cps=10}สารวัตรทาเครุได้อธิบายเกี่ยวกับคดีฆาตรกรรมต่อเนื่องที่เกี่ยวข้องกับคนรอบตัวของ อิจิ โซมะ ให้ทุกคนในที่นี่รับรู้{/cps}"
                            show chr_d14 at left
                            hide chr_f13 at left
                            s "{cps=10}เป็นอย่างนี้นี่เองสินะ เป็นเพราะฉันสินะที่ทำให้คนรอบตัวผมเกิดเรื่องขึ้น{/cps}"
                            show chr_c14 at left
                            hide chr_d14 at left
                            r "{cps=10}ใจเย็นๆนะครับ คุณอิจิ โซมะ มันไม่เป็นเพราะคุณหรอกครับ{/cps}"
                            show chr_d14 at left
                            hide chr_c14 at left
                            s "{cps=10}แต่สุดท้ายมันเป็นเพราะผมอยู่ดี{/cps}"
                            show chr_c14 at left
                            hide chr_d14 at left
                            r  "{cps=10}ถ้างั้นที่คุณเสียใจกับเรื่องนี้อยู่ ผมขอให้แนะนำตัวกับทุกคนก่อนนะครับ{/cps}"
                            m "{cps=10}ผมชื่อ โดมะ นิโตะ  เป็นผู้ช่วยเซฟของ คุณอิจิ โซมะ {/cps}"
                            hide chr_c14 at left
                            show chr_h4 at right 
                            hide chr_e1 at right
                            o  "{cps=10}หนู ชื่อ มาอาระ นากิซัง  เป็นนักเขียนนิยาย{/cps}"
                            show chr_i12 at left
                            hide chr_d14 at left
                            show chr_h1 at right 
                            hide chr_h4 at right
                            f "{cps=10}ผม ชื่อ ย่งเนด้ง โดเซบ้า  เป็นนักวิจารณ์อาหาร วิจารณ์เรื่องไวน์เป็นพิเศษ{/cps}"
                            show chr_i14 at left
                            hide chr_i12 at left
                            show chr_b4 at right 
                            hide chr_h1 at right
                            g " {cps=10}ส ส ส่วนหนู ช ช ชื่อนิวารา ชิโกะ เป็น จิตรกร{/cps}"
                            show chr_l13 at left
                            hide chr_i14 at left 
                            hide chr_b4 at right
                            u  "{cps=10}ส่วนผม ชื่อ โรคุ ดุกิ เป็นนักถ่ายรูป{/cps}"
                            show chr_l14 at left
                            hide chr_l13 at left
                            show chr_j4 at right 
                            n  "{cps=10}ฉัน ชื่อ ซิโรริ นานะ เป็นนางแบบชื่อดัง แล้วพวกคุณล่ะชื่ออะไร{/cps}"
                            hide chr_l14 at left
                            hide chr_j4 at right
                            $  name1_y = False
                            $  name2_y = False
                            c "{cps=10}อย่างงี้นี้เอง คุณโดมะ นิโตะ ในชื่อมีคำว่า นิ ที่เป็นเลข 2 อยู่ ส่วนคุณ มาอาระ นากิซัง {/cps}"
                            c "{cps=10}ในชื่อมีคำว่า ซัน ที่เป็นเลข 3 ส่วนคุณ ย่งเนด้ง โดเซบ้า ในชื่อมีคำว่า ย่ง ที่เป็นเลข 4 อยู่{/cps}"
                            c "{cps=10}ส่วน คุณนิวารา ชิโกะ ในชื่อมีคำว่า โกะ ที่เป็นเลข 5 ส่วนคุณ โรคุ ดุกิ {/cps}"
                            c "{cps=10}ซึ่งมีชื่อตรงตัวที่แปลว่า 6 และคุณ ซิโรริ นานะ มีนามสกุลที่แปลว่า 7{/cps}"
                            show chr_a2
                            b "{cps=10} ถูกต้องตามนั้นเลยครับ คู่หู วิเคราะห์ได้เฉียบแหลมมาก {/cps}"
                            b "{cps=10} เอาล่ะ จะเริ่มแนะนำตัวจากผมก่อนเลย{/cps}"
                            hide chr_a2
                            jump name
