label go1:
                j "{cps=10}ได้เลย เอาตามนั้น{/cps}"
                scene work3
                c  "{cps=10}ยาสุโอะ! ! ! พวกเรามีงานด่วน เตรียมตัวไปสำนักงานตำรวจ{/cps}"
                show chr_a2
                b  "{cps=10}งานอะไรงั้นเหรอ{/cps}"
                hide chr_a2
                show chr_a3
                c  "{cps=10}งานสืบสวนคดีฆาตกรรม เราจะไปฟังรายละเอียดเพิ่มเติมที่สำนักงานตำรวจ {/cps}"
                hide chr_a3
                show chr_a2
                b " {cps=10}โอเค เดี๋ยวจะไปเตรียมอุปกรณ์สืบสวนครับ{/cps}"
                hide chr_a2
                "{cps=10}%(c)s กำลังไปที่โต๊ะทำงานตนเองเพื่อเตรียมอุปกรณ์สืบสวน{/cps}"
                label tools2:
                    call screen workroom3
                label item7:
                            scene work2
                            $  tool_y +=1
                            label tol:
                                scene work2
                                show tools 
                                c "{cps=10}เจอเครื่องมือแล้ว{/cps}"
                                $ f8 = True
                                hide tools
                                jump tool2
                label item8:
                                scene work3
                                c "{cps=10}อือ อ อ ไม่มีเครื่องมืออะไรเลย{/cps}"
                                if click_count < max_clicks:
                                    $ click_count += 1
                                    jump tools2
                                else:
                                    $ click_count = 0
                                    jump tools1
                label item10:
                            scene work1
                            $  tool_y +=1
                            label tol1:
                                scene work1
                                show zoom1
                                c "{cps=10}เจอแว่นขยายแล้ว{/cps}"
                                $ f9 = True
                                hide zoom1
                                jump tool1                    
                label tool2:
                            call screen workroom2
                label item9:
                            scene work2
                            $  tool_y +=1
                            label tool:
                                scene work
                                show zoom1
                                c "{cps=10}เจอแว่นขยายแล้ว{/cps}"
                                $ f9 = True
                                hide zoom1
                                jump tools1
                label item6:
                                scene work2
                                c "{cps=10}อือ อ อ ไม่มีเครื่องมืออะไรเลย{/cps}"
                                if click_count < max_clicks:
                                    $ click_count += 1
                                    jump tool2
                                else:
                                    $ click_count = 0
                                    jump tools1            
                label tool1:
                            call screen workroom1
                label item3:
                            scene work1
                            $  tool_y +=1
                            label tol2:
                                scene work
                                show tools 
                                c "{cps=10}เจอเครื่องมือแล้ว{/cps}"
                                $ f8 = True
                                hide tools
                                jump tools1
                label item2:
                                scene work1
                                c "{cps=10}อือ อ อ ไม่มีเครื่องมืออะไรเลย{/cps}"
                                if click_count < max_clicks:
                                    $ click_count += 1
                                    jump tool1
                                else:
                                    $ click_count = 0
                                    jump tools1                 
                label tools1:
                    b "{cps=10}โอเคครับ{/cps}"
                    hide chr_a2
                    "{cps=10}หลังจากเวลาผ่านไปสักพัก{/cps}"
                    show chr_a2
                    b  "{cps=10}เตรียมตัวเสร็จแล้ว %(c)s เตรียมตัวเสร็จรึยัง{/cps}"
                    hide chr_a2
                    show chr_a3
                    c "{cps=10}เตรียมตัวเสร็จแล้วเหมือนกัน{/cps}"
                    hide chr_a3
                    show chr_a2
                    b "{cps=10}แน่ใจแล้วเหรอ มีอะไรที่ลืมรึเปล่า{/cps}" 
                    hide chr_a2
                    $ click_count = 0
                    jump gowhere
label go2:
                j "{cps=10}ได้เลย เอาตามนั้น{/cps}"
                scene b
                "{cps=10}นักสืบได้หยิบโทรศัพท์ขึ้นมา แล้วทำการกดเลือกเบอร์โทร ผู้ช่วยนักสืบ ยาสุโอะ แล้วกดโทรออก{/cps}"
                b "{cps=10}สวัสดี นักสืบมีเรื่องอะไรเกิดขึ้นหรอ ถึงได้ติดต่อมา{/cps}"
                c "{cps=10}มีงานสืบสวนคดีเข้ามา รีบไปเจอกันที่สถานีตำรวจ เป็นงานที่เร่งด่วนมาก{/cps}"
                b "{cps=10}โอเค จะรีบไปเดี๋ยวนี้{/cps}"
                "{cps=10}หลังจากที่คุยนัดแนะกับผู้ช่วยนักสืบเสร็จ นักสืบก็รีบเดินทางไปสถานีตำรวจ{/cps}"   
                jump gowhere
label gowhere:
                    scene police
                    "{cps=10}ณ สำนักงานตำรวจ ที่ห้องรับแขก ที่พวกเราและสารวัตรทาเครุกำลังคุยเรื่องคดีอยู่{/cps}"
                    show chr_f12 at left 
                    j "{cps=10}เอาล่ะ มาครบกันแล้วสินะ เจ้าหน้าที่ โจ เอารูปถ่ายให้นักสืบหน่อย{/cps}"
                    hide chr_f12 at left 
                    show chr_f13 at left 
                    show chr_g1 at right
                    a "{cps=10}นี่รูปถ่ายในคดีที่ทางตำรวจพบวัตถุพยานและรอยบาดแผลของผู้เสียหายครับ{/cps}"
                    hide chr_f13 at left
                    hide chr_g1 at right
                    show king at left
                    show queen at right
                    $  tool_y +=2
                    $ f3 = True
                    $ f4 = True
                    ""
                    hide king at left
                    hide queen at right
                    show chr_f12 at left
                    j "{cps=10}รูปถ่ายเกี่ยวกับวัตถุพยานในที่เกิดเหตุ ที่แห่งแรกมีดาบอยู่ในที่เกิดเหตุ
                    ส่วนแห่งที่สองมีดอกไม้สีขาวอยู่ในที่เกิดเหตุ ซึ่งวัตถุพยานทั้งคู่ตกอยู่ในที่เกิดเหตุของผู้เสียหาย{/cps}"
                    j "{cps=10}และรูปถ่ายของผู้เสียหายคนแรกชื่อจูโซ ยามะได้บาดเจ็บที่ท้องล่างซ้าย ซึ่งโดนยิงด้วยลูกธนู{/cps}"
                    j "{cps=10}ส่วนผู้เสียหายคนที่สอง ชื่อ จูยามุ นิโนะ ได้รับพิษขณะที่รับประทานอาหารที่มีพิษที่ร้ายแรงถึงตาย แต่นำตัวส่งโรงพยาบาลทันเลยรอดครับ{/cps}"
                    hide chr_f12 at left 
                    show chr_f13 at left
                    show chr_a4
                    b  "{cps=10}แล้วมีอะไรเพิ่มเติมอีกไหมครับ{/cps}"
                    hide chr_a4
                    show chr_a3
                    hide chr_f13 at left
                    show chr_f12 at left
                    j "{cps=10}คดีนี้เกิดเรื่องจากเมื่อสองวันก่อน ในเกิดเหตุของผู้เสียหายรายแรกอยู่ที่สวนสาธารณะ และผู้เสียหายรายที่สองเกิดที่ร้านอาหารฝรั่งเศสเมื่อวันก่อน{/cps}"
                    j "{cps=10}แล้วทางเราได้ตรวจสอบทั้งสองสถานที่แล้ว แต่ไม่พบเจออะไรที่ต้องสงสัยเลย 
                    ทางเราอยากให้นักสืบอย่างพวกคุณมาช่วยสืบคดีให้หน่อย{/cps}"
                    hide chr_f12 at left 
                    hide chr_a3
                    show chr_f13 at left
                    show chr_a2
                    b "{cps=10}ตกลงครับ ไว้ใจทางพวกผมได้เลยครับ{/cps}"
                    b "{cps=10}พวกเรา จะเริ่มสืบที่ไหนกันก่อนดีครับ{/cps}"
                    hide chr_a2
                    show chr_a3
                    
                    label gowheree:
                        menu : 
                            c"   "
                            "สวนสาธารณะ":
                                jump Gowhere1
                            "ร้านอาหารฝรั่งเศส":
                                jump Gowhere2
                    label Gowhere1:
                           hide chr_a3
                           show chr_a2
                           b "{cps=10}โอเค งั้นพวกเราจะไปที่สวนสาธารณะกันเลย{/cps}"
                           hide chr_a2
                           show chr_a3
                           c  "{cps=10}ได้เลยคู่หู{/cps}"
                           hide chr_a3
                           show chr_a2
                           b "{cps=10}สารวัตรทาเครุ งั้นพวกเราจะเริ่มสืบก่อนนะครับ{/cps}"
                           hide chr_a2
                           show chr_a3
                           hide chr_f13 at left
                           show chr_f12 at left
                           j "{cps=10}อืม แล้วขอบใจที่ช่วยคำขอร้องในครั้งนี้{/cps}"
                           hide chr_a3
                           show chr_a2
                           hide chr_f12 at left
                           show chr_f13 at left
                           b "{cps=10}ไม่เป็นไร มันเป็นงานของพวกเราอยู่แล้วครับ{/cps}"
                           hide chr_a2
                           hide chr_f13 at left
                           "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s ได้ออกจากสำนักงานตำรวจ{/cps}"
                           scene park
                           "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังสืบสวนที่เกิดเหตุเพื่อจะหาหลักฐานและวัตถุเพิ่มเติม{/cps}"
                           show chr_a2
                           b "{cps=10}พวกเราจะเริ่มสืบจากตรงไหนดี{/cps}"
                           hide chr_a2
                           show chr_a3
                           c "{cps=10}ก็คงหาที่ที่คิดว่าคนร้ายจะใช้ดักซุ่มยิงใส่ผู้เสียหายจากตรงไหนดีกว่า 
                           ซึ่งความเป็นไปได้คือบริเวณที่อับสายตาผู้คน ที่สามารถพรางสายตาผู้คนได้{/cps}"
                           hide chr_a3
                           show chr_a2
                           b "{cps=10}งั้นหาจุดที่ผู้เสียหายได้รับบาดเจ็บจากการโดนยิงก่อน{/cps}"
                           hide chr_a2
                           show chr_a3
                           c  "{cps=10}โอเค งั้นเริ่มกันเลย{/cps}"
                           hide chr_a3
                           show chr_a2
                           b  "{cps=10}เราหาที่ไหนดีนะ{/cps}"
                           hide chr_a2
                           $ loot_y = False
                           $ loot1_y = False
                           
                           label Where:
                             menu : 
                                c"   "
                                "ต้นไม้":
                                    jump where0
                                "แม่น้ำ" if loot_y == False:
                                    jump where2
                                "สนามเด็กเล่น" if loot1_y == False:
                                    jump where3
                           label where0:
                               scene tree1
                               c "เริ่มสำรวจสถานที่ค้นหาหลักฐานกันเลย"
                               jump where1
                           label where1:
                              scene tree1
                              call screen Tree
                           label tree1:
                               $ tool_y += 1
                               scene tree
                               show fa
                               c  "{cps=10}นี้มัน ขนนก{/cps}"
                               $ f1 = True
                               hide fa
                               c  "{cps=10}หรือว่าจะเป็น ขนนกลูกดอกหน้าไม้ อย่าบอกน่ะว่า คนร้ายใช้จุดนี้เป็นที่สุ่มยิง{/cps}"
                               show chr_a4
                               b "{cps=10}มีความเป็นไปไปได้สูงอย่างมาก{/cps}" 
                               hide chr_a4
                               jump tree5
                           label tree2:
                               "ท้องฟ้าวันนี้อากาศดี"
                               if click_count < max_clicks:
                                    $ click_count += 1
                                    jump where1
                               else:
                                    $ click_count = 0
                                    jump tree5
                           label tree3:
                               "ไม่มีอะไรที่เป็นหลักฐานหรือร่องรอยของคนร้ายทิ้งไว้"
                               if click_count < max_clicks:
                                    $ click_count += 1
                                    jump where1
                               else:
                                    $ click_count = 0
                                    jump tree5         
                           label tree5:
                              $ tool_y += 1
                              $ f6 = True
                              c  "{cps=10}ยาสุโอะ!!! เจอบางอย่างล่ะ{/cps}"
                              show chr_a4
                              b "{cps=10}ไหนดูหน่อยสิ{/cps}" 
                              hide chr_a4
                              "{cps=10}รอยรองเท้าและกิ่งไม้รอบๆของพุ่มไม้{/cps}"
                              show chr_a2
                              b "{cps=10}ผมคิดว่าคนร้ายน่าจะยิงธนูจากตรงต้นไม้ เดี๋ยวผมจะขึ้นไปบนต้นไม้ดูว่ามีอะไรอีกไหม{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}โอเค  ฝากนายจัดการด้วย{/cps}"
                              hide chr_a3
                              "{cps=10}เวลาผ่านไปหลังจากยาสุโอะปีนขึ้นไปดูบนต้นไม้{/cps}"
                              show chr_a2
                              b "{cps=10}%(c)s มีร่องรอยของคนที่ปีนขึ้นมาบนต้นไม้ด้วยครับ{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}โอเค แต่เราก็ยังไม่สามารถสรุปได้ว่าเป็นคนร้ายรึเปล่า หลักฐานไม่เพียงพอต่อการสรุป 
                              แล้วยาสุโอะที่ไปหาหลักฐานตรงจุดอื่นเจออะไรบ้างไหม{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ไม่เจอร่องรอยอะไรที่ผิดปกติเลยครับ{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}งั้นพวกเราจะไปค้นหาหลักฐานที่ร้านอาหารฝรั่งเศส ที่อยู่ในที่เกิดเหตุต่อเลย ยาสุโอะ{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ครับ{/cps}"
                              hide chr_a2
                              scene food
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังเข้าไปในร้านอาหารเพื่อที่จะสืบหาหลักฐานในที่เกิดเหตุแห่งที่สอง เพื่อตามหาเบาะแสที่เกี่ยวข้องกับคนร้าย{/cps}"
                              c "{cps=10}เจ้าของร้านอาหาร พวกเราขออนุญาติสอบถามเหตุการณ์ที่เกิดขึ้นในร้านอาหารของคุณหน่อยครับ ไม่อนุญาติให้ปฏิเสธ{/cps}"
                              show chr_d3 at right
                              s "{cps=10}ฮ่าฮ่าฮ่า ได้สิ พวกเราไม่มีอะไรให้ปฏิเสธอยู่แล้ว ร้านเราทำงานสุจริต 
                                ไม่มีอะไรให้ปิดบัง แต่ไม่รู้ว่าทำไมถึงเกิดเหตุการณ์เช่นนี้ สววรค์ช่างไม่มีตา{/cps}"
                              hide chr_d3 at right
                              show chr_d2 at right
                              c "{cps=10}ช่วงนี้คุณมีอะไรที่ผิดปกติในชีวิตประจำวันไหม หรือ ในร้านอาหารบ้างไหม{/cps}"
                              hide chr_d2 at right
                              show chr_d3 at right
                              s "{cps=10}มีครับ ช่วงนี้ลูกจ้างได้ทำงานช้าลงเนื่องจากลูกค้ามีเยอะ
                                ทำให้ผู้เชี่ยวชาญไวน์มีคนให้บริการไม่เพียงพอ เลยได้เปลี่ยนให้เป็นการจองโต๊ะที่ร้านแทนเพื่อความสะดวกในการทำงานของลูกจ้างให้ดีขึ้น{/cps}"
                              hide chr_d3 at right
                              show chr_d2 at right
                              c "{cps=10}ขอบคุณเจ้าของร้านอาหารที่ช่วยการสอบสวนด้วยนะครับ{/cps}" 
                              hide chr_d2 at right
                              show chr_d3 at right
                              s "{cps=10}ฮ่าฮ่าฮ่า ไม่เป็นไร เพื่อหาตัวคนร้ายให้เร็วขึ้นครับ ช่วยได้สักนิดก็ถือว่ายินดีมาก{/cps}"
                              hide chr_d3 at right
                              show  chr_d2 at right
                              c "{cps=10}โอเคครับ วันนี้พวกเราขอตัวกลับก่อนนะครับ{/cps}"
                              hide chr_d2 at right
                              show chr_d3 at right
                              s "{cps=10}ฮ่าฮ่า ด้วยความยินดีครับ{/cps}"
                              hide chr_d3 at right
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s ได้ออกจากร้านอาหารเพื่อที่จะกลับไปที่ห้องทำงานในสำนักงานนักสืบ{/cps}"
                              scene work
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังสรุปข้อมูลที่ได้สืบมาในวันนี้{/cps}"
                              c "{cps=10}ยาสุโอะ ได้ข้อมูลอะไรจากที่ร้านอาหารฝรั่งเศสบ้างไหม{/cps}"
                              show chr_a2
                              b "{cps=10}มีการใส่ยาพิษไม่ใช่ในอาหารแต่เป็นช้อนส้อมแทน{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}สรุปว่า คนร้ายในที่เกิดเหตุแรกได้ยิงลูกธนูจากที่ไหนไม่รู้ไปยังผู้เสียหายคนแรก
                              แต่ผู้เสียหายแรกได้รับบาดเจ็บที่ท้องล่างซ้าย{/cps}"
                              c "{cps=10}ส่วนผู้เสียหายรายที่สองได้รับยาพิษจากช้อนส้อมที่คนร้ายวางยาไว้ เมื่อมารับประทานอาหารที่ร้าน{/cps}"
                              c "{cps=10}ก็ได้สัมผัสพิษที่อยู่บนช้อนส้อมสิน่ะ ซึ่งเป็นพิษชนิดไร้สีไร้กลิ่นด้วย แล้วทั้งสองเหตุการณ์ก็ได้ผลเมืองดีช่วยนำตัวส่งโรงพยาบาลสินะ{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ก็น่าจะเป็นแบบนั้นนะครับ เป็นการสรุปที่เฉียบขาดมากครับ{/cps}"
                              hide chr_a2
                              jump three
                           label where2:
                              scene river
                              "{cps=10}เวลาผ่านไป 15 นาทีหลังจากได้หาบริเวณตรงแม่น้ำ{/cps}"
                              label loot :
                                  c "{cps=10}ไม่มีอะไรที่ผิดปกติเลย น่าจะไปค้นหาที่อื่นต่อกันดีไหม{/cps}"
                                  menu :
                                      "ค้นหาที่อื่นต่อ":
                                          $ loot_y = True
                                          jump Where
                                      "ค้นหาที่นี่ต่อ":
                                          jump loot1
                           label loot1:
                              "{cps=10}เวลาผ่านไป 2 ชั่วโมง{/cps}" 
                              c "{cps=10}ไม่มีหลักฐานหรือร่องรอยอะไรทิ้งไว้เลย  เฮ้ ยาสุโอะเจออะไรที่ผิดปกติบ้างไหม{/cps}"
                              show chr_a1
                              b "{cps=10}ก็ไม่มีอะไรผิดปกติครับ{/cps}"
                              hide chr_a1
                              show chr_a3
                              c "{cps=10}งั้นพวกเราจะไปที่หาร้านอาหารฝรั่งเศสในที่เกิดเหตุต่อเลย ยาสุโอะ{/cps}"
                              hide chr_a3
                              show chr_a1
                              b "{cps=10}ครับ{/cps}"
                              hide chr_a1
                              scene food
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังเข้าไปในร้านอาหารเพื่อที่จะสืบหาหลักฐานในที่เกิดเหตุแห่งที่สอง เพื่อตามหาเบาะแสที่เกี่ยวข้องกับคนร้าย{/cps}"
                              c "{cps=10}เจ้าของร้านอาหาร พวกเราขออนุญาติสอบถามเหตุการณ์ที่เกิดขึ้นในร้านอาหารของคุณหน่อยครับ ไม่อนุญาติให้ปฏิเสธ{/cps}"
                              show chr_d2 at right
                              s "{cps=10} ฮ่าฮ่าฮ่า ได้สิ พวกเราไม่มีอะไรให้ปฏิเสธอยู่แล้ว ร้านเราทำงานสุจริต 
                                ไม่มีอะไรให้ปิดบัง แต่ไม่รู้ว่าทำไมถึงเกิดเหตุการณ์เช่นนี้ สววรค์ช่างไม่มีตา{/cps}"
                              hide chr_d2 at right
                              show chr_d3 at right
                              c "{cps=10}ช่วงนี้คุณมีอะไรที่ผิดปกติในชีวิตประจำวันไหม หรือ ในร้านอาหารบ้างไหม{/cps}"
                              hide chr_d3 at right
                              show chr_d2 at right
                              s "{cps=10}มีครับ ช่วงนี้ลูกจ้างได้ทำงานช้าลงเนื่องจากลูกค้ามีเยอะ
                                ทำให้ผู้เชี่ยวชาญไวน์มีคนให้บริการไม่เพียงพอ เลยได้เปลี่ยนให้เป็นการจองโต๊ะที่ร้านแทนเพื่อความสะดวกในการทำงานของลูกจ้างให้ดีขึ้น{/cps}"
                              hide chr_d2 at right
                              show chr_d3 at right
                              c "{cps=10}ขอบคุณเจ้าของร้านอาหารที่ช่วยการสอบสวนด้วยนะครับ{/cps}" 
                              hide chr_d3 at right
                              show chr_d2 at right
                              s "{cps=10}ฮ่าฮ่าฮ่า ไม่เป็นไร เพื่อหาตัวคนร้ายให้เร็วขึ้นครับ ช่วยได้สักนิดก็ถือว่ายินดีมาก{/cps}"
                              hide chr_d2 at right
                              show chr_d3 at right
                              c "{cps=10}โอเคครับ วันนี้พวกเราขอตัวกลับก่อนนะครับ{/cps}"
                              hide chr_d3 at right
                              show chr_d2 at right
                              s "{cps=10}ฮ่าฮ่าฮ่า ด้วยความยินดีครับ{/cps}"
                              hide chr_d2 at right
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s ได้ออกจากร้านอาหารเพื่อที่จะกลับไปที่ห้องทำงานในสำนักงานนักสืบ{/cps}"
                              scene work
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังสรุปข้อมูลที่ได้สืบมาในวันนี้{/cps}"
                              c "{cps=10}ยาสุโอะ ได้ข้อมูลอะไรจากที่ร้านอาหารฝรั่งเศสบ้างไหม{/cps}"
                              show chr_a2
                              b "{cps=10}มีการใส่ยาพิษไม่ใช่ในอาหารแต่เป็นช้อนส้อมแทน{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}สรุปว่า คนร้ายในที่เกิดเหตุแรกได้ยิงลูกธนูจากที่ไหนไม่รู้ไปยังผู้เสียหายคนแรก
                              แต่ผู้เสียหายแรกได้รับบาดเจ็บที่ท้องล่างซ้าย{/cps}"
                              c "{cps=10}ส่วนผู้เสียหายรายที่สองได้รับยาพิษจากช้อนส้อมที่คนร้ายวางยาไว้ เมื่อมารับประทานอาหารที่ร้าน{/cps}"
                              c "{cps=10}ก็ได้สัมผัสพิษที่อยู่บนช้อนส้อมสิน่ะ ซึ่งเป็นพิษชนิดไร้สีไร้กลิ่นด้วย แล้วทั้งสองเหตุการณ์ก็ได้ผลเมืองดีช่วยนำตัวส่งโรงพยาบาลสินะ{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ก็น่าจะเป็นแบบนั้นนะครับ เป็นการสรุปที่เฉียบขาดมากครับ{/cps}"
                              hide chr_a2
                              jump three
                           label where3:
                              scene f
                              "{cps=10}เวลาผ่านไป 15 นาทีหลังจากได้หาบริเวณตรงสนามเด็กเล่น{/cps}"
                              label loot2:
                                  c "{cps=10}ไม่มีอะไรที่ผิดปกติเลย พบเจอแต่สิ่งของทั่วไปที่เด็กเล่น น่าจะไปหาที่อื่นต่อกันดีไหม{/cps}"
                                  menu:
                                      "ค้นหาที่อื่นต่อ":
                                          $ loot1_y = True
                                          jump Where
                                      "ค้นหาที่นี่ต่อ":
                                          jump loot3
                           label loot3:
                              "{cps=10}เวลาผ่านไป 2 ชั่วโมง{/cps}" 
                              c "{cps=10}ไม่มีหลักฐานหรือร่องรอยอะไรทิ้งไว้เลย   เฮ้ ยาสุโอะเจออะไรที่ผิดปกติบ้างไหม{/cps}"
                              show chr_a1
                              b "{cps=10}ก็ไม่มีอะไรผิดปกติครับ{/cps}"
                              hide chr_a1
                              show chr_a3
                              c "{cps=10}งั้นพวกเราจะไปที่หาร้านอาหารฝรั่งเศสในที่เกิดเหตุต่อเลย ยาสุโอะ{/cps}"
                              hide chr_a3
                              show chr_a1
                              b "{cps=10}ครับ{/cps}"
                              hide chr_a1
                              scene food
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังเข้าไปในร้านอาหารเพื่อที่จะสืบหาหลักฐานในที่เกิดเหตุแห่งที่สอง เพื่อตามหาเบาะแสที่เกี่ยวข้องกับคนร้าย{/cps}"
                              c "{cps=10}เจ้าของร้านอาหาร พวกเราขออนุญาติสอบถามเหตุการณ์ที่เกิดขึ้นในร้านอาหารของคุณหน่อยครับ ไม่อนุญาติให้ปฏิเสธ{/cps}"
                              show chr_d2 at right
                              s "{cps=10} ฮ่าฮ่าฮ่า ได้สิ พวกเราไม่มีอะไรให้ปฏิเสธอยู่แล้ว ร้านเราทำงานสุจริต 
                              ไม่มีอะไรให้ปิดบัง แต่ไม่รู้ว่าทำไมถึงเกิดเหตุการณ์เช่นนี้ สววรค์ช่างไม่มีตา{/cps}"
                              hide chr_d2 at right
                              show chr_d3 at right
                              c "{cps=10}ช่วงนี้คุณมีอะไรที่ผิดปกติในชีวิตประจำวันไหม หรือ ในร้านอาหารบ้างไหม{/cps}"
                              hide chr_d3 at right
                              show chr_d2 at right
                              s "{cps=10}มีครับ ช่วงนี้ลูกจ้างได้ทำงานช้าลงเนื่องจากลูกค้ามีเยอะ
                              ทำให้ผู้เชี่ยวชาญไวน์มีคนให้บริการไม่เพียงพอ เลยได้เปลี่ยนให้เป็นการจองโต๊ะที่ร้านแทนเพื่อความสะดวกในการทำงานของลูกจ้างให้ดีขึ้น{/cps}"
                              hide chr_d2 at right
                              show chr_d3 at right
                              c "{cps=10}ขอบคุณเจ้าของร้านอาหารที่ช่วยการสอบสวนด้วยนะครับ{/cps}" 
                              hide chr_d3 at right
                              show chr_d2 at right
                              s "{cps=10}ฮ่าฮ่าฮ่า ไม่เป็นไร เพื่อหาตัวคนร้ายให้เร็วขึ้นครับ ช่วยได้สักนิดก็ถือว่ายินดีมาก{/cps}"
                              hide chr_d2 at right
                              show chr_d3 at right
                              c "{cps=10}โอเคครับ วันนี้พวกเราขอตัวกลับก่อนนะครับ{/cps}"
                              hide chr_d3 at right
                              show chr_d2 at right
                              s "{cps=10}ฮ่าฮ่าฮ่า ด้วยความยินดีครับ{/cps}"
                              hide chr_d2 at right
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s ได้ออกจากร้านอาหารเพื่อที่จะกลับไปที่ห้องทำงานในสำนักงานนักสืบ{/cps}"
                              scene work
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังสรุปข้อมูลที่ได้สืบมาในวันนี้{/cps}"
                              c "{cps=10}ยาสุโอะ ได้ข้อมูลอะไรจากที่ร้านอาหารฝรั่งเศสบ้างไหม{/cps}"
                              show chr_a2
                              b "{cps=10}มีการใส่ยาพิษไม่ใช่ในอาหารแต่เป็นช้อนส้อมแทน{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}สรุปว่า คนร้ายในที่เกิดเหตุแรกได้ยิงลูกธนูจากที่ไหนไม่รู้ไปยังผู้เสียหายคนแรก
                              แต่ผู้เสียหายแรกได้รับบาดเจ็บที่ท้องล่างซ้าย{/cps}"
                              c "{cps=10}ส่วนผู้เสียหายรายที่สองได้รับยาพิษจากช้อนส้อมที่คนร้ายวางยาไว้ เมื่อมารับประทานอาหารที่ร้าน{/cps}"
                              c "{cps=10}ก็ได้สัมผัสพิษที่อยู่บนช้อนส้อมสิน่ะ ซึ่งเป็นพิษชนิดไร้สีไร้กลิ่นด้วย แล้วทั้งสองเหตุการณ์ก็ได้ผลเมืองดีช่วยนำตัวส่งโรงพยาบาลสินะ{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ก็น่าจะเป็นแบบนั้นนะครับ เป็นการสรุปที่เฉียบขาดมากครับ{/cps}"
                              hide chr_a2
                              jump three
                    label Gowhere2:
                         scene food
                         "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังเข้าไปในร้านอาหารเพื่อที่จะสืบหาหลักฐานในที่เกิดเหตุแห่งที่สอง เพื่อตามหาเบาะแสที่เกี่ยวข้องกับคนร้าย{/cps}"
                         c "{cps=10}เจ้าของร้านอาหาร พวกเราขออนุญาติสอบถามเหตุการณ์ที่เกิดขึ้นในร้านอาหารของคุณหน่อยครับ ไม่อนุญาติให้ปฏิเสธ{/cps}"
                         show chr_d2 at right
                         s "{cps=10}ฮ่าฮ่าฮ่า ได้สิ พวกเราไม่มีอะไรให้ปฏิเสธอยู่แล้ว ร้านเราทำงานสุจริต 
                         ไม่มีอะไรให้ปิดบัง แต่ไม่รู้ว่าทำไมถึงเกิดเหตุการณ์เช่นนี้ สววรค์ช่างไม่มีตา{/cps}"
                         hide chr_d2 at right
                         show chr_d3 at right
                         c "{cps=10}ช่วงนี้คุณมีอะไรที่ผิดปกติในชีวิตประจำวันไหม หรือ ในร้านอาหารบ้างไหม{/cps}"
                         hide chr_d3 at right
                         show chr_d2 at right
                         s "{cps=10}มีครับ ช่วงนี้ลูกจ้างได้ทำงานช้าลงเนื่องจากลูกค้ามีเยอะ
                           ทำให้ผู้เชี่ยวชาญไวน์มีคนให้บริการไม่เพียงพอ  เลยได้เปลี่ยนให้เป็นการจองโต๊ะที่ร้านแทนเพื่อความสะดวกในการทำงานของลูกจ้างให้ดีขึ้น{/cps}"
                         hide chr_d2 at right
                         show chr_d3 at right
                         c "{cps=10}ขอบคุณเจ้าของร้านอาหารที่ช่วยการสอบสวนด้วยนะครับ{/cps}" 
                         hide chr_d3 at right
                         show chr_d2 at right
                         s "{cps=10}ฮ่าฮ่าฮ่า ไม่เป็นไร เพื่อหาตัวคนร้ายให้เร็วขึ้นครับ ช่วยได้สักนิดก็ถือว่ายินดีมาก{/cps}"
                         hide chr_d2 at right
                         show chr_d3 at right
                         c "{cps=10}โอเคครับ วันนี้พวกเราขอตัวไปสืบที่อื่นต่อนะครับ ขอให้โชคดี{/cps}"
                         hide chr_d3 at right
                         show chr_d2 at right
                         s "{cps=10}ฮ่าฮ่า ด้วยความยินดีครับ{/cps}"
                         hide chr_d2 at right
                         "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s ได้ออกจากร้านอาหารเพื่อจะหาหลักฐานและวัตถุเพิ่มเติมที่สวนสาธารณะต่อ{/cps}"
                         scene park
                         show chr_a2
                         b "{cps=10}พวกเราจะเริ่มสืบจากตรงไหนดี{/cps}"
                         hide chr_a2
                         show chr_a3
                         c "{cps=10}ก็คงหาที่ที่คิดว่าคนร้ายจะใช้ดักซุ่มยิงใส่ผู้เสียหายจากตรงไหนดีกว่า 
                           ซึ่งความเป็นไปได้คือบริเวณที่อับสายตาผู้คน ที่สามารถพรางสายตาผู้คนได้{/cps}"
                         hide chr_a3
                         show chr_a2
                         b "{cps=10}งั้นหาจุดที่ผู้เสียหายได้รับบาดเจ็บจากการโดนยิงก่อน{/cps}"
                         hide chr_a2
                         show chr_a3
                         c "{cps=10}โอเค งั้นเริ่มกันเลย{/cps}"
                         c "{cps=10}เราหาที่ไหนดีนะ{/cps}"
                         hide chr_a3
                         
                         $ loot_y2 = False
                         $ loot_y3 = False
                         label Where2:
                             menu : 
                                 c"   "
                                 "ต้นไม้":
                                     jump where7
                                 "แม่น้ำ"if loot_y2 == False :
                                     jump where5
                                 "สนามเด็กเล่น"if loot_y3 == False :
                                     jump where6
                                    
                         label where7:
                               scene tree1
                               c "เริ่มสำรวจสถานที่ค้นหาหลักฐานกันเลย"
                               jump where4
                         label where4:
                              scene tree1
                              call screen Tree1
                         label tree4:
                               show fa
                               $ tool_y += 1
                               c  "{cps=10}นี้มัน ขนนก{/cps}"
                               $ f1 = True
                               hide fa
                               scene tree
                               c  "{cps=10}หรือว่าจะเป็น ขนนกลูกดอกหน้าไม้ อย่าบอกน่ะว่า คนร้ายใช้จุดนี้เป็นที่สุ่มยิง{/cps}"
                               show chr_a4
                               b "{cps=10}มีความเป็นไปไปได้สูงอย่างมาก{/cps}" 
                               hide chr_a4
                               jump tree8
                         label tree6:
                               "ท้องฟ้าวันนี้อากาศดี"
                               if click_count < max_clicks:
                                    $ click_count += 1
                                    jump where4
                               else:
                                    $ click_count = 0
                                    jump tree8
                         label tree7:
                               "ไม่มีอะไรที่เป็นหลักฐานหรือร่องรอยของคนร้ายทั้งไว้"
                               if click_count < max_clicks:
                                    $ click_count += 1
                                    jump where4
                               else:
                                    $ click_count = 0
                                    jump tree8      
                         label tree8:
                              $ tool_y += 1
                              $ f6 = True
                              c  "{cps=10}ยาสุโอะ!!! เจอบางอย่างล่ะ{/cps}"
                              show chr_a4
                              b "{cps=10}ไหนดูหน่อยสิ{/cps}" 
                              hide chr_a4
                              "{cps=10}รอยรองเท้าและกิ่งไม้รอบๆของพุ่มไม้{/cps}"
                              show chr_a2
                              b "{cps=10}ผมคิดว่าคนร้ายน่าจะยิงธนูจากตรงต้นไม้ เดี๋ยวผมจะขึ้นไปบนต้นไม้ดูว่ามีอะไรอีกไหม{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}โอเค  ฝากนายจัดการด้วย{/cps}"
                              hide chr_a3
                              "{cps=10}เวลาผ่านไปหลังจากยาสุโอะปีนขึ้นไปดูบนต้นไม้{/cps}"
                              show chr_a2
                              b "{cps=10}%(c)s มีร่องรอยของคนที่ปีนขึ้นมาบนต้นไม้ด้วยครับ{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}โอเค แต่เราก็ยังไม่สามารถสรุปได้ว่าเป็นคนร้ายรึเปล่า หลักฐานไม่เพียงพอต่อการสรุป 
                              แล้วยาสุโอะที่ไปหาหลักฐานตรงจุดอื่นเจออะไรบ้างไหม{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ไม่เจอร่องรอยอะไรที่ผิดปกติเลยครับ{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}งั้นพวกเราไปสรุปหลักฐานจากที่พบเจอที่ห้องทำงานในสำนักงานนักสืบกันก่อน ยาสุโอะ{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ครับ{/cps}"
                              hide chr_a2
                              scene work
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังสรุปข้อมูลที่ได้สืบมาในวันนี้{/cps}"
                              c "{cps=10}ยาสุโอะ ได้ข้อมูลอะไรจากที่ร้านอาหารฝรั่งเศสบ้างไหม{/cps}"
                              show chr_a2
                              b "{cps=10}มีการใส่ยาพิษไม่ใช่ในอาหารแต่เป็นช้อนส้อมแทน{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}สรุปว่า คนร้ายในที่เกิดเหตุแรกได้ยิงลูกธนูจากที่ไหนไม่รู้ไปยังผู้เสียหายคนแรก
                              แต่ผู้เสียหายแรกได้รับบาดเจ็บที่ท้องล่างซ้าย{/cps}"
                              c "{cps=10}ส่วนผู้เสียหายรายที่สองได้รับยาพิษจากช้อนส้อมที่คนร้ายวางยาไว้ เมื่อมารับประทานอาหารที่ร้าน{/cps}"
                              c "{cps=10}ก็ได้สัมผัสพิษที่อยู่บนช้อนส้อมสิน่ะ ซึ่งเป็นพิษชนิดไร้สีไร้กลิ่นด้วย แล้วทั้งสองเหตุการณ์ก็ได้ผลเมืองดีช่วยนำตัวส่งโรงพยาบาลสินะ{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ก็น่าจะเป็นแบบนั้นนะครับ เป็นการสรุปที่เฉียบขาดมากครับ{/cps}"
                              hide chr_a2
                              jump three
                         label where5:
                              scene river
                              "{cps=10}เวลาผ่านไป 15 นาทีหลังจากได้หาบริเวณตรงแม่น้ำ{/cps}"
                         label loot4:
                             c "{cps=10}ไม่มีอะไรที่ผิดปกติเลย น่าจะไปหาที่อื่นต่อกันดีไหม{/cps}"
                             menu :
                                  "ค้นหาที่อื่นต่อ":
                                      $ loot_y2 = True
                                      jump Where2
                                  "ค้นหาที่นี่ต่อ":
                                      jump loot5
                         label loot5:   
                              "{cps=10}เวลาผ่านไป 2 ชั่วโมง{/cps}" 
                              c "{cps=10}ไม่มีหลักฐานหรือร่องรอยอะไรทิ้งไว้เลย  เฮ้ ยาสุโอะเจออะไรที่ผิดปกติบ้างไหม{/cps}"
                              show chr_a1
                              b "{cps=10}ก็ไม่มีอะไรผิดปกติครับ{/cps}"
                              hide chr_a1  
                              show ชาย
                              c "{cps=10}งั้นพวกเราไปสรุปหลักฐานจากที่พบเจอที่ห้องทำงานในสำนักงานนักสืบกันก่อน ยาสุโอะ{/cps}"
                              hide ชาย
                              show ชาย1
                              b "{cps=10}ครับ{/cps}"
                              hide ชาย1
                              scene work
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังสืบข้อมูลที่ได้มาวันนี้{/cps}"
                              c "{cps=10}ยาสุโอะ ได้ข้อมูลอะไรจากที่ร้านอาหารฝรั่งเศสบ้างไหม{/cps}"
                              show chr_a2
                              b "{cps=10}มีการใส่ยาพิษไม่ใช่ในอาหารแต่เป็นช้อนส้อมแทน{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}สรุปว่า คนร้ายในที่เกิดเหตุแรกได้ยิงลูกธนูจากที่ไหนไม่รู้ไปยังผู้เสียหายคนแรก
                              แต่ผู้เสียหายแรกได้รับบาดเจ็บที่ท้องล่างซ้าย{/cps}"
                              c "{cps=10}ส่วนผู้เสียหายรายที่สองได้รับยาพิษจากช้อนส้อมที่คนร้ายวางยาไว้ เมื่อมารับประทานอาหารที่ร้าน{/cps}"
                              c "{cps=10}ก็ได้สัมผัสพิษที่อยู่บนช้อนส้อมสิน่ะ ซึ่งเป็นพิษชนิดไร้สีไร้กลิ่นด้วย แล้วทั้งสองเหตุการณ์ก็ได้ผลเมืองดีช่วยนำตัวส่งโรงพยาบาลสินะ{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ก็จะน่าเป็นแบบนั้นนะครับ{/cps}"
                              hide chr_a2
                              jump three
                         label where6:
                              scene f
                              "{cps=10}เวลาผ่านไป 15 นาทีหลังจากได้หาบริเวณตรงสนามเด็กเล่น{/cps}"
                         label loot6:
                             c "{cps=10}ไม่มีอะไรที่ผิดปกติเลย พบเจอแต่สิ่งของทั่วไปที่เด็กเล่น น่าจะไปหาที่อื่นต่อกันดีไหม{/cps}"
                             menu:
                                  "ค้นหาที่อื่นต่อ":
                                      $ loot_y3 = True
                                      jump Where2
                                  "ค้นหาที่นี่ต่อ":
                                      jump loot7
                         label loot7:
                              "{cps=10}เวลาผ่านไป 2 ชั่วโมง{/cps}" 
                              c "{cps=10}ไม่มีหลักฐานหรือร่องรอยอะไรทิ้งไว้เลย   เฮ้ ยาสุโอะเจออะไรที่ผิดปกติบ้างไหม{/cps}"
                              show chr_a1
                              b "{cps=10}ก็ไม่มีอะไรผิดปกติครับ{/cps}"
                              hide chr_a1
                              show chr_a3
                              c "{cps=10}งั้นพวกเราไปสรุปหลักฐานจากที่พบเจอที่ห้องทำงานในสำนักงานนักสืบกันก่อน ยาสุโอะ{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ครับ{/cps}"
                              hide chr_a2
                              scene work
                              "{cps=10}ผู้ช่วย ยาสุโอะ และ %(c)s กำลังสรุปข้อมูลที่ได้สืบมาในวันนี้{/cps}"
                              c "{cps=10}ยาสุโอะ ได้ข้อมูลอะไรจากที่ร้านอาหารฝรั่งเศสบ้างไหม{/cps}"
                              show chr_a2
                              b "{cps=10}มีการใส่ยาพิษไม่ใช่ในอาหารแต่เป็นช้อนส้อมแทน{/cps}"
                              hide chr_a2
                              show chr_a3
                              c "{cps=10}สรุปว่า คนร้ายในที่เกิดเหตุแรกได้ยิงลูกธนูจากที่ไหนไม่รู้ไปยังผู้เสียหายคนแรก
                              แต่ผู้เสียหายแรกได้รับบาดเจ็บที่ท้องล่างซ้าย{/cps}"
                              c "{cps=10}ส่วนผู้เสียหายรายที่สองได้รับยาพิษจากช้อนส้อมที่คนร้ายวางยาไว้ เมื่อมารับประทานอาหารที่ร้าน{/cps}"
                              c "{cps=10}ก็ได้สัมผัสพิษที่อยู่บนช้อนส้อมสิน่ะ ซึ่งเป็นพิษชนิดไร้สีไร้กลิ่นด้วย แล้วทั้งสองเหตุการณ์ก็ได้ผลเมืองดีช่วยนำตัวส่งโรงพยาบาลสินะ{/cps}"
                              hide chr_a3
                              show chr_a2
                              b "{cps=10}ก็น่าจะเป็นแบบนั้นนะครับ เป็นการสรุปที่เฉียบขาดมากครับ{/cps}"
                              hide chr_a2
                              jump three
                    
