            label give:
                menu : 
                    c"   "
                    "ลงน้ำตาม":
                        jump give1
                    "รอสักพัก":
                        jump give2
            
            label give1:
                c "{cps=10}งั้นรีบไปดีกว่าก่อนอควาเรียมจะพังมากกว่านี้{/cps}"
                scene on1
                "{cps=10}ทุกคนขึ้นจากน้ำอย่างปลอดภัยแต่คุณเนด้งย่งที่ใกล้หมดสติจากการหายใจในน้ำนานไป{/cps}"
                show chr_e11 at left
                t "{cps=10}ผมช่วยผายปอดให้คุณเนด้งย่งเอง เพราะผมมีความรู้เกี่ยวกับ cprอยู่บ้างครับ{/cps}"
                show chr_f12 at left
                hide chr_e11 at left
                j "{cps=10}งั้นก็ฝาก..{/cps}."
                show chr_f13 at left
                hide chr_f12 at left
                c "{cps=10}ช้าก่อนคุณจิกิตะ  เดี๋ยวผมให้ยาสุโอะไปผายปอดให้คุณเนด้งย่ง ยาสุโอะ{/cps}!"
                show chr_a2
                b "{cps=10}โอเค จะรีบผายปอดกับคุณเนด้งย่งเอง{/cps}"
                show chr_a3
                hide chr_a2
                c " {cps=10}ในขณะนั้นยาสุโอะผายปอดให้คุณเนด้งย่ง ผมรู้จุดประสงค์ของคนร้ายและใครเป็นคนร้ายด้วย{/cps}"
                $ renpy.music.stop(channel="sound_effect")
                $ renpy.music.queue("audio/job.mp3", channel="sound_effect")
                v "{cps=10}ว่าไงนะ นายรู้แน่จริงๆนะเหรอ{/cps}"
                c "{cps=10}ผมและยาสุโอะรู้แล้วว่าใคร แต่ว่าขอลำดับเหตุการณ์ก่อนเลย{/cps}"
                c "{cps=10}ลำดับแรกคือคนร้ายใช้เลขบนไพ่ที่เป็นโพดำให้เราเห็นกัน{/cps}"
                c "{cps=10}นำประโยชน์จากเลขไพ่เป็นความผิดของพวกเขา เพื่อให้พวกเราและคนอื่นคิดว่าพวกเขาเป็นต้นเหตุและตัวหลักของเหตุการณ์นี้{/cps}"
                hide chr_f13 at left
                hide chr_a3
                jump island
            label give2:    
                c "{cps=10}รอคนไปก่อนเนื่องจากมีสิ่งต้องทำอยู่{/cps}"
                c "{cps=10}แต่ทำไมไพ่ถึงลอยขึ้นมาอยู่ในจุดเดียวกัน หรือว่าคนร้ายเก็บไว้ในเสื้อสินะ 
                งั้นเรารีบขึ้นฝั่งก่อนที่คนร้ายจะไปฆ่าใครเพิ่มอีก{/cps}"
                scene on1
                "{cps=10}ทุกคนขึ้นจากน้ำอย่างปลอดภัยแต่คุณเนด้งย่งที่ได้หมดสติจากการกลั่นหายใจในน้ำไม่ไหว{/cps}"
                show chr_e11  at left
                t "{cps=10}ผมช่วยผายปอดให้คุณเนด้งย่งเอง เพราะผมมีความรู้เกี่ยวกับ cprอยู่บ้างครับ{/cps}"
                show chr_f12 at left
                hide chr_e11 at left
                j "{cps=10}งั้นก็ฝาก..{/cps}."
                show chr_f13 at left
                hide chr_f12 at left
                c "{cps=10}ช้าก่อนคุณจิกิตะ  เดี๋ยวผมให้ยาสุโอะไปผายปอดให้คุณเนด้งย่ง ยาสุโอะ{/cps}!"
                show chr_a2
                b "{cps=10}โอเค จะรีบผายปอดให้กับคุณเนด้งย่งเอง{/cps}"
                show chr_a3
                hide chr_a2
                c "{cps=10} ในขณะนั้นยาสุโอะผายปอดให้คุณเนด้งย่ง ผมรู้จุดประสงค์ของคนร้ายและใครเป็นคนร้ายแล้วด้วย{/cps}"
                $ renpy.music.stop(channel="sound_effect")
                $ renpy.music.queue("audio/job.mp3", channel="sound_effect")
                v "{cps=10}ว่าไงนะ นายรู้แน่จริงๆนะเหรอ{/cps}"
                c "{cps=10}ผมและยาสุโอะรู้แล้วว่าเป็นใคร ขอเรียงลำดับเหตุการณ์ก่อนเลย{/cps}"
                c "{cps=10}ลำดับแรกคือคนร้ายใช้เลขบนไพ่ที่เป็นโพดำให้เราเห็นกัน คำตอบคือ{/cps}"
                c "{cps=10}คุณจูโคโร่ อาคายุย ไม่ใช่คนร้าย แต่คนร้ายบังเอิญเจอ คุณจูโคโร่ อาคายุย 
                           สักที่นึง แล้วได้ฆ่าคุณจูโคโร่ อาคายุย{/cps}"
                c "{cps=10}หลังจากที่ได้พูดคุยเกี่ยวกับเรื่องราวของคุณอิจิ โซมะที่เป็นเพื่อนสมัยเด็ก และได้ใช้ประโยชน์จากเลขบนไพ่
                         ที่คุณจูโคโร่ อาคายุย เคยเป็นเจ้ามือไพ่เมื่อสมัยก่อน เพื่อให้พวกเราและคนอื่นคิดว่า{/cps}"
                c "{cps=10}คุณจูโคโร่ อาคายุยเป็นต้นเหตุและตัวหลักของเหตุการณ์นี้ {/cps}"
                show chr_d11 at left
                hide chr_f13 at left
                s "{cps=10}ถ้างั้นมันไม่ใช่ความผิดของผม แต่คนร้ายต้องการความเกี่ยวข้องกับเรื่องราวของผมมาทำร้ายคนอื่นสินะ{/cps}"
                show chr_d14 at left
                hide chr_d11 at left
                c "{cps=10}ถูกต้อง{/cps}"
                show chr_d11 at left
                hide chr_d14 at left
                s "{cps=10}แก ก แกที่ฆ่าเพื่อนสมัยเด็กที่รู้ใจมาตั้งแต่เด็กของฉัน ให้อภัยมันไม่ได้เด็ดขาด{/cps}"
                hide chr_a3 
                hide chr_d11 at left
                jump island
                
            label island:
                c "{cps=10}ต่อมาลำดับสองคนร้ายจะฆ่าตามลำดับเลขบนไพ่ทั้งหมด จริงไหมล่ะ
                           คำตอบคือ ไม่จริง เพราะคนร้ายใช้เลขไพ่มาบังหน้ากับคนที่เขาอยากฆ่า หลังจากฆ่าคุณจูโคโร่ อาคายุย{/cps}"
                show chr_b4 at right
                g "{cps=10}แปลว่าหนูไม่เกี่ยวกับเหตุการณ์นี้ตั้งแต่แรก แค่เพิ่มมาให้เลขครบใช่มั้ย{/cps}"
                hide chr_b4 at right
                show chr_l14 at left
                u "{cps=10}แล้วคนที่ไม่เกี่ยวข้องก็แค่ทำร้ายให้บาดเจ็บ แต่ไม่ได้หมายเอาชีวิตสินะ{/cps}"
                show chr_l13 at left
                hide chr_l14 at left
                c  "{cps=10}ใช่ครับ ส่วนคนโดนฆ่า ก็มีคุณนานะ คุณคิวจู  และคุณเนด้งย่งที่เป็นคนสุดท้ายที่เขาอยากฆ่า{/cps}"
                show chr_a2 
                b "{cps=10}%(c)s คุณเนด้งย่งฟื้นแล้วครับ{/cps}"
                show chr_a3 
                hide chr_a2 
                c "{cps=10}ขอบคุณ ยาสุโอะขอเล่าต่อนะ{/cps}"
                c "{cps=10}คนร้ายได้ฆ่าคุณคิวจู ตั้งแต่เมื่อวานตอนกลางคืน และได้ส่งคำเชิญให้พวกคุณทุกคนที่มีชื่อผวนตรงกับเลขบนไพ่มารวมตัวพร้อมกับเอาน้ำยาทาเล็บ
                ไปให้กับคุณนานะ{/cps}"
                c "{cps=10}เพื่อตอนไฟดับที่เขาเตรียมการเอาไว้จะได้ฆ่าคุณนานะโดยมีดในความมืด
                แล้วหนีไปใกล้กลุ่มคน และรอให้ใครสักคนเปิดเบรกเกอร์ ก็จะไม่มีใครรู้ว่าใครเป็นคนทำร้ายคุณนานะ{/cps}"
                c "{cps=10}ส่วนคุณเนด้งย่ง เขาเป็นคนว่ายน้ำไม่เป็น คนร้ายได้อาศัยช่องช่องโหว่ที่เขาว่ายน้ำไม่เป็นจึงระเบิดอควาเรียมเพื่อกลบหลักฐานที่
                เขาเป็นคนทำและให้น้ำท่วมอควาเรียมเพื่อที่จะฆ่าคุณเนด้งย่ง{/cps}"
                show chr_i11 at left
                hide chr_l13 at left
                f "{cps=10}เมื่อกี้ผมเกือบไม่รอดแล้วน่ะครับ ถ้าไม่มีคนช่วยไว้ผมคงตายไปแล้วครับ{/cps}"
                show chr_i14 at left
                hide chr_i11 at left
                c "{cps=10}ใช่ครับถ้าไม่ใช่คุณยาสุโอะผายปอดแทน คนร้ายอาจมาเนียนทำเป็นให้ความช่วยเหลือ มาขอช่วยทำcprและฆ่าคุณเนด้งย่ง {/cps}"
                c "{cps=10}ด้วยวิธีการที่จะแกล้งทำเป็นผายปอดแล้วปิดจมูกของคุณแล้วปิดปากให้ขาดอากาศหายใจ {/cps}"
                c "{cps=10}แล้วสักพักคุณก็จะหลับสบายโดยไม่ตื่นอีกเลย{/cps}"
                show chr_h4 at right
                o "{cps=10}เดี๋ยวนะค่ะ  งั้นรู้สินะว่าใครเป็นคนร้ายนะ{/cps}"
                hide chr_h4 at right
                c "ใช่"
                hide chr_i14 at left
                show chr_f14 at left
                j "{cps=10}แล้วใครเป็นคนร้ายล่ะ{/cps}"
                hide chr_a3 
                hide chr_f14 at left
                jump who
