                    label ed1:
                        "หลังจากนั้นตำรวจได้ตรวจสอบเพิ่มเติมตามที่นักสืบบอก"
                        "แต่ผู้ต้องสงสัยก็ไม่ใช่คนร้ายตามที่นักสืบสันนิษฐานไว้ ทำให้ไม่เจอคนร้ายที่แท้จริง"
                        "ทำให้คดีในครั้งนี้ไม่สามารถหาตัวคนร้ายเจอได้ 
                        และเป็นคดีที่ไม่สามารถระบุตัวคนร้ายได้ คนร้ายได้ลอยนวลไปตลาดกาล"
                        $ end_y += 1
                        if s1 == True:
                                jump gery1
                        if s2 == True:
                                jump gery2
                        if s4 == True:
                                jump gery3
                        if s5 == True:
                                jump gery4
                        if s3 == True:
                                jump gery5
                    label gery1:    
                        scene gery
                        image n1 = Text("นักสืบสามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของโดมะ นิโตะ\nมาระบุตัวคนร้าย แต่เนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น \nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน\nทำให้ระบุตัวคนร้ายผิดและหลักฐานไม่เพียงพอต่อการจับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n1
                        ""
                        hide n1
                        "ฉาก bad end 1 ความผิดพลาดของนักสืบ"
                        jump end
                    label gery2:    
                        scene gery
                        image n2 = Text("นักสืบสามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของมาอาระ นากิซัน\nมาระบุตัวคนร้าย แต่เนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น \nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน\nทำให้ระบุตัวคนร้ายผิดและหลักฐานไม่เพียงพอต่อการจับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n2
                        ""
                        hide n2
                        "ฉาก bad end 1 ความผิดพลาดของนักสืบ"
                        jump end
                    label gery3:    
                        scene gery
                        image n3 = Text("นักสืบสามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของนิวารา ชิโกะ\nมาระบุตัวคนร้าย แต่เนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น \nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน\nทำให้ระบุตัวคนร้ายผิดและหลักฐานไม่เพียงพอต่อการจับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n3
                        ""
                        hide n3
                        "ฉาก bad end 1 ความผิดพลาดของนักสืบ"
                        jump end
                    label gery4:    
                        scene gery
                        image n4 = Text("นักสืบสามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของโรคุ ดุกิ\nมาระบุตัวคนร้าย แต่เนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น \nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน\nทำให้ระบุตัวคนร้ายผิดและหลักฐานไม่เพียงพอต่อการจับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n4
                        ""
                        hide n4
                        "ฉาก bad end 1 ความผิดพลาดของนักสืบ"
                        jump end    
                    label gery5:    
                        scene gery
                        image n5 = Text("นักสืบสามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของเนด้งย่ง โดเซบ้า\nมาระบุตัวคนร้าย แต่เนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น \nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน\nทำให้ระบุตัวคนร้ายผิดและหลักฐานไม่เพียงพอต่อการจับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n5
                        ""
                        hide n5
                        "ฉาก bad end 1 ความผิดพลาดของนักสืบ"
                        jump end
                        
                    label ed2:
                        "หลังจากนั้นพวกสารวัตรได้ตรวจสอบเพิ่มเติมตามที่นักสืบบอก"
                        "แต่ก็ไม่เจอหลักฐานที่จะใช้ระบุตัวผู้ต้องสงสัยว่าเป็นคนร้ายตัวจริงได้"
                        "ทางตำรวจจึงตรวจสอบค้นหาคนร้ายต่อไป แต่สุดท้ายก็ไม่เจอและทำให้คนร้ายลอยนวล"
                        "ทำให้คดีในครั้งนี้ไม่สามารถหาตัวคนร้ายเจอได้ 
                        และเป็นคดีที่ไม่สามารถระบุตัวคนร้ายได้ คนร้ายได้หายตัวไปตลาดกาล"
                        $ end_y += 1
                        if s1 == True:
                                jump gery6
                        if s2 == True:
                                jump gery7
                        if s4 == True:
                                jump gery8
                        if s5 == True:
                                jump gery9
                        if s3 == True:
                                jump gery10
                    label gery6:            
                        scene gery
                        image n6 = Text("นักสืบไม่สามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของโดมะ นิโตะ\nมาระบุตัวคนร้ายได้และเนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น\nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน \nทำให้ระบุตัวคนร้ายผิดและไม่มีหลักฐานที่นำมาใช้จับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n6
                        " "
                        hide n6
                        "ฉาก bad end 2 ความรับผิดชอบของนักสืบ"
                        jump end
                    label gery7:            
                        scene gery
                        image n7 = Text("นักสืบไม่สามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของมาอาระ นากิซัน\nมาระบุตัวคนร้ายได้และเนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น\nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน \nทำให้ระบุตัวคนร้ายผิดและไม่มีหลักฐานที่นำมาใช้จับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n7
                        " "
                        hide n7
                        "ฉาก bad end 2 ความรับผิดชอบของนักสืบ"
                        jump end
                    label gery8:            
                        scene gery
                        image n8 = Text("นักสืบไม่สามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของนิวารา ชิโกะ\nมาระบุตัวคนร้ายได้และเนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น\nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน \nทำให้ระบุตัวคนร้ายผิดและไม่มีหลักฐานที่นำมาใช้จับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n8
                        " "
                        hide n8
                        "ฉาก bad end 2 ความรับผิดชอบของนักสืบ"
                        jump end
                    label gery9:            
                        scene gery
                        image n9 = Text("นักสืบไม่สามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของโรคุ ดุกิ\nมาระบุตัวคนร้ายได้และเนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น\nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน \nทำให้ระบุตัวคนร้ายผิดและไม่มีหลักฐานที่นำมาใช้จับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n9
                        " "
                        hide n9
                        "ฉาก bad end 2 ความรับผิดชอบของนักสืบ"
                        jump end
                    label gery10:            
                        scene gery
                        image n10 = Text("นักสืบไม่สามารถนำหลักฐานที่ค้นพบและการสนทนากับผู้เข้าข่ายของเนด้งย่ง โดเซบ้า\nมาระบุตัวคนร้ายได้และเนื่องจากข้อมูลที่นักสืบค้นพบไม่เพียงพอต่อการสรุปเหตุการณ์ที่เกิดขึ้น\nจึงทำให้ทราบเรื่องราวทั้งหมดไม่ครบถ้วน \nทำให้ระบุตัวคนร้ายผิดและไม่มีหลักฐานที่นำมาใช้จับกุมตัวคนร้าย\nทำให้คนร้ายร้อยนวลไปได้ซึ่งเป็นคดีที่ไม่สามารถจับตัวคนร้ายได้ "
                             , color="#ffde2c", size=24, xpos=0.5, ypos=0.5)
                        show n10
                        " "
                        hide n10
                        "ฉาก bad end 2 ความรับผิดชอบของนักสืบ"
                        jump end
